Revit 2024 API
BuiltInFailures.DimensionFailures.UnstableConstraintInFamily Property
 Constraints between geometry in the family can behave unpredictably on parameter modification. To make the family reliable, constrain geometry to levels, reference planes, or reference lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId UnstableConstraintInFamily { get; }
Visual Basic
Public Shared ReadOnly Property UnstableConstraintInFamily As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ UnstableConstraintInFamily {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace